{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (black-and-white color scheme, 3D visuals in all sections, monochrome navbar/footer) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of each frontend source file, covering components, hooks, data files, and config.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for a strict black-and-white light and dark color scheme used by shadcn-style components.",
  "frontend/index.html": "Minimal HTML shell titled 'Orbit Org 3D' that mounts the React app at the #root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that composes the full single-page layout by assembling Navbar, Hero3D, About, MissionVision, Services, Team, Contact, and Footer in order.",
  "frontend/src/components/About.tsx": "About section featuring a React Three Fiber canvas with floating wireframe geometric shapes and a particle cloud in white/gray, plus scroll-animated monochrome text and stats.",
  "frontend/src/components/Contact.tsx": "Contact section with a React Three Fiber canvas displaying a rotating wireframe torus knot, icosahedron, and orbital rings, alongside a monochrome contact form and info cards.",
  "frontend/src/components/Footer.tsx": "Site footer with a black background, white/gray text and nav links, monochrome social icons, grayscale logo, and a caffeine.ai attribution link.",
  "frontend/src/components/Hero3D.tsx": "Renders an animated 3D hero background using React Three Fiber with animated spheres, wireframe shapes, a particle field, rotating rings, and mouse-tracked camera movement. Pulls organization content from orgContent for display.",
  "frontend/src/components/Interactive3DCards.tsx": "Renders a row of interactive 3D box cards using React Three Fiber where each card corresponds to a service, supporting hover and selection states with scale and emissive material changes.",
  "frontend/src/components/MissionVision.tsx": "Displays the organization's mission and vision section with a 3D animated background featuring rotating wireframe geometries and grid lines, with scroll-triggered fade-in animations.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar that transitions from transparent to a blurred dark background on scroll, with smooth-scroll nav links and a responsive mobile hamburger menu.",
  "frontend/src/components/Services.tsx": "Displays organization services with an interactive 3D card selector, a detail panel for the selected service, and a grid of clickable service buttons with scroll-triggered animations.",
  "frontend/src/components/Team.tsx": "Renders the team section with a 3D animated background of particles, a wireframe grid, and floating octahedron shapes, displaying team member cards with scroll-triggered animations.",
  "frontend/src/data/orgContent.ts": "Defines all static content for the G4U (Growth For You) organisation website, including name, tagline, about, mission, vision, values, services, and team data as exported constants.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to track when a referenced element enters the viewport, returning a ref and isVisible boolean for scroll-triggered animations.",
  "frontend/src/index.css": "Global CSS file that sets up a strict black-and-white dark-mode theme using Tailwind and oklch color tokens, imports Google Fonts, and defines utility classes for gradients, glows, scroll animations, and scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, oklch-based monochrome color tokens, border radii, box shadows, and animation keyframes, with typography, container queries, and animate plugins enabled.",
  "project_state.json": "Tracks the project's current state including version, summary, architectural notes (black-and-white palette, 3D elements throughout), and a list of implemented features for the interactive 3D organisation website."
}